{
    "projects": [
        {
            "id": "1",
            "title": "Netmatters recreation",
            "img": "project-netmatters.jpg",
            "description": "My first major assignment in the SCS was to recreate the Netmatters website using all the HTML and CSS knowledge I had gained thus far. I iterated upon this project twice in the course: first adding JavaScript features, then later converting it to PHP complete with database functionality.",
            "url": "https://netmatters.otis-moorman.netmatters-scs.co.uk"
        },
        {
            "id": "2",
            "title": "Terracotta Catering",
            "img": "project-pairs.jpg",
            "description": "I was paired up with another student on the course and given a website design to create from scratch. This was my first experience collaborating on a web project, as well as creating a consistent site-wide design from a single page concept.",
            "url": "https://pairs.otis-moorman.netmatters-scs.co.uk"
        },
        {
            "id": "3",
            "title": "imgAt",
            "img": "project-imgat.jpg",
            "description": "This was my first project where I had a lot of freedom and could design a site with JavaScript in mind from the start. I was tasked with implementing an API that would load a random image which the user could then assign to a validated email address.",
            "url": "https://imgat.otis-moorman.netmatters-scs.co.uk"
        },
        {
            "id": "4",
            "title": "WordPress Reflection",
            "img": "project-wordpress.jpg",
            "description": "Here I was tasked with create a site using WordPress. I created my own custom theme using the Underscores framework, and constructed the site with search engine optimisation in mind for the content, which consistently scored around 80/90 in Rank Math.",
            "url": "https://wordpress.otis-moorman.netmatters-scs.co.uk"
        },
        {
            "id": "5",
            "title": "C# Reflection",
            "img": "project-cs.png",
            "description": "For C#, I had to make a small company/employees database using ASP.NET and Entity Framework Core. I had to set up a local SQL database with relational databases entirely in code, and incorporated CRUD functionality through an MVC pattern. This was my first time working on a full-fledged C# project, and really helped solidify my understanding of object-oriented programming.",
            "url": "https://github.com/otism94/CS-Reflection-2"
        },
        {
            "id": "6",
            "title": "Firefly Events prototype",
            "img": "project-figma.png",
            "description": "I was given a brief to design a website for an events-hosting client. I used Figma to create both mobile and desktop prototypes, plus Adobe Illustrator to create several logos. When I was finished I had to give a presentation to walk through my design. This was my first big taste of web design work taking a client's wishes into account.",
            "url": "https://www.figma.com/proto/TWxuQfUtx9RvHAskJebS6U/Firefly-Events?node-id=7%3A48&starting-point-node-id=7%3A48"
        },
        {
            "id": "7",
            "title": "RoShamBot",
            "img": "project-unity.png",
            "description": "This was my first ever solo Unity project that I designed and coded from scratch. It's a little rough around the edges, but it really helped me get comfortable with the Unity engine workflow, as well as serving as invaluable programming practice material due to its heavy use of C# and the free-form, problem-solving nature of game development.",
            "url": "https://play.unity.com/mg/other/roshambot"
        },
        {
            "id": "8",
            "title": "WooCommerce project",
            "img": "project-woocommerce.jpg",
            "description": "In this small project, I made a simple store with WordPress using the WooCommerce plugin. This gave me some familiarity with ecommerce interfaces as well as giving me more practice with WordPress itself.",
            "url": "https://woocommerce.otis-moorman.netmatters-scs.co.uk"
        }
    ]
}