{
    "projects": [
        {
            "id": "1",
            "title": "HTML/CSS Reflection",
            "img_file": "img/projects/project-1.jpg",
            "description": "My first major assignment under the Scion Coalition Scheme was to recreate the pre-existing Netmatters website using all the HTML and CSS knowledge I had gained up to that point, as pixel-perfect as possible using the mobile-first approach. Later in the course, I was tasked to revisit this project and add JavaScript functionality to the site, including an image carousel, dynamic sticky header, sidebar navigation, and a cookies pop-up window, plus smaller bits of JS throughout the page, such as a toggleable search bar. While doing this, I also practised organising my workflow using Gulp to maintain separate source and distribution builds, which required the utilisation of npm packages.",
            "repo": "https://github.com/otism94/js-reflection-challenge-1"
        },
        {
            "id": "2",
            "title": "Pair Project",
            "img_file": "img/projects/project-2.jpg",
            "description": "I was paired up with another student on the course and given a website design to create from scratch. This was my first experience with collaboration on a web project and as such required extra organisation and frequent check-ups with my partner to make sure we were on-track. As we only had a prototype for the homepage, for the rest of the site, it was up to us to carry that design over and make sure everything was visually cohesive.",
            "repo": "https://github.com/Tomby07/Pair-Project"
        },
        {
            "id": "3",
            "title": "JavaScript Reflection",
            "img_file": "img/projects/project-3.jpg",
            "description": "This was my first project where I had a lot of freedom and could design a site with JavaScript in mind from the start. I was tasked with implementing an API that would load a random image which the user could then assign to a validated email address. The site kept track of all the linked images and emails in that session, all done entirely with JavaScript. This was my first foray into external requests, for which I used Axios for comprehensive browser support. Additionally, I put a lot of time into refining the UX and making the page fully adaptive.",
            "repo": "https://github.com/otism94/js-reflection-challenge-2"
        }
    ]
}